---
kind: enumMember
id: F:Autodesk.Revit.DB.StorageType.String
enum: Autodesk.Revit.DB.StorageType
source: html/3dbebcb8-792b-a3dd-fe63-faaa05704f3c.htm
---
# Autodesk.Revit.DB.StorageType.String

The internal data will be stored in the form of a string of characters.